




START_USER_TEXT = '''
<b>Приветственное сообщение пользователь!</b>

'''


START_BARISTA_TEXT = '''
<b>Приветственное сообщение бариста!</b>

'''


START_ADMIN_TEXT = '''
<b>Приветственное сообщение админ!</b>

'''




REFERRAL_SYSTEM_TEXT = '''
<span class="tg-spoiler">ТЕКСТ РЕФЕРАЛЬНОЙ СИСТЕМЫ</span>

Пригласи человека и получи <b>кружку</b> на свой счет!

Твоя реферальная ссылка:
    <code>{referral_link}</code>
'''


RULES_TEXT = '''
<span class="tg-spoiler">ТЕКСТ СИСТЕМЫ ЛОЯЛЬНОСТИ</span>

Система лояльности "Кружка-за-дружка" представляет собой ...

'''



MANY_CUPS_TEXT = '''
У пользователя <b>{name}</b> 

{cups} кружек!

Выберите действие:
'''


ADD_A_CUP_TEXT = '''
Подтвердите начисление <b>одной кружки</b> для пользователя <b>{name}</b>

Кол-во кружек: <b>{cups}</b>
'''





SUCCESS_ADD_A_CUP_TEXT='''
Пользователю успешно начислена 

<b>+1 кружка</b>!

Кол-во кружек теперь: <b>{cups}</b>
'''


SUCCESS_DEDUCT_A_CUP_TEXT='''
Пользователю успешно списано 

<b>-10 кружек</b>!

Кол-во кружек теперь: <b>{cups}</b>
'''
CANCEL_TEXT = 'Отмена'